{"name":"Lei Zhu","headerTaglineOne":"Hello 👋","headerTaglineTwo":"I'm Lei Zhu 朱磊","headerTaglineThree":"Seeking opportunites as Data Analyst or Data Scientist","headerTaglineFour":" Currently based in Chengdu, China","showCursor":false,"showBlog":true,"darkMode":true,"showResume":true,"socials":[{"id":"1","title":"Github","link":"https://github.com/Vincent-Zhul"},{"id":"2","title":"LinkedIn","link":"https://www.linkedin.com/in/lei-zhu-970930328/"},{"id":"5","title":"Email","link":"mailto:vincent0414zhu@outlook.com"}],
"projects":[
    {   "id":"1",
        "title":"FlightInfoHub - Database Management",
        "description":"Flight information query system",
        "imageSrc":"http://raw.githubusercontent.com/Vincent-Zhul/personal-react-portfolio-DA/main/public/images/flightinfohub.webp", 
        "details":" Deployed a flight information query system on the AWS platform, a web application based on MySQL that integrates global flight data from OpenFlights, providing a comprehensive platform for querying and analyzing aviation data. - Constructed backend logic using Java and Spring Boot, and achieved efficient interaction with the MySQL database through JDBC technology, ensuring accurate and efficient data processing. - Developed the frontend using HTML and CSS, creating a clear and straightforward user interface, which enhanced the user interaction process and visual experience. - Designed and implemented complex SQL query optimizations, including effective indexing for routes, airports, and airline data, significantly improving query speed and data processing performance. - Managed the storage and updates of project code and documentation on GitHub, ensuring transparency in the development process and traceability of the code, supporting team collaboration and continuous integration of the project."},
    {   "id":"2",
        "title":"EU Unemployment Visualization",
        "description":"Data analysis with PowerBI and Tableau",
        "imageSrc":"http://raw.githubusercontent.com/Vincent-Zhul/personal-react-portfolio-DA/main/public/images/EUViz.webp",
        "details":" Developed an EU unemployment trends dashboard, focusing on age and gender disparities as well as regional trends, utilizing PowerBI and Tableau for data visualization. - Processed extensive EU unemployment data in Excel, performing segmentation by age and gender, and applied advanced data cleaning across 50+ sheets for integration into the dashboard. - Created the EU Countries Unemployed Map in PowerBI, using a color gradient to illustrate unemployment rates, and added a filter, allowing for interactive exploration of regional and temporal data. - Developed interactive dashboards in Tableau for detailed unemployment analysis, including an Unemployment Population Table with interactive filters, emphasizing age related unemployment trends."},
    {   "id":"3",
        "title":"Intelligent Profile",
        "description":"Java Full-stack Development",
        "imageSrc":"https://raw.githubusercontent.com/Vincent-Zhul/personal-react-portfolio-DA/main/public/images/IntelliProfile.webp",
        "details":" Developed a full stack, LinkedIn like web application featuring a chatbot, enabling user registration and access to professional profiles. The chatbot, powered by ChatGPT‘s API, provides dynamic, intelligent responses, enhancing user engagement. - Crafted the frontend with HTML, CSS, and JavaScript for an engaging user interface, and used Java and Spring Boot for backend dynamic content management. - Employed MySQL for data storage, utilizing Java Persistence API (JPA) and Hibernate for efficient Object Relational Mapping (ORM), ensuring smooth data handling. - Integrated Spring Security to provide robust user authentication and authorization, securing user data and enhancing platform trustworthiness. - Achieved deployment on AWS, using EC2 for hosting, RDS for data management, and VPC for secure networking, ensuring consistent availability and minimal error rates."},
    {   "id":"4",
        "title":"Scientific Translation Practice System",
        "description":"Develop and Design Back-end System and UI",
        "imageSrc":"https://raw.githubusercontent.com/Vincent-Zhul/personal-react-portfolio-DA/main/public/images/Translation.webp",
        "details":" Developed a Python based text translation practice system for students, integrating real time scoring, progress tracking, and iFlytek API for enhanced translation feedback. - Managed backend development with API communication, scoring algorithms, and maintained an efficient SQLite3 database for data management. - Created a Tkinter GUI for seamless multitasking and automated scientific text retrieval from the ArXiv database. - Implemented the iFlytek API for accurate Chinese English translations and MarianMTModel for term extraction, augmenting the system's NLP capabilities. - Employed asynchronous operations for optimized performance, particularly in data retrieval tasks."},
    {   "id":"5",
        "title":"JD Comment Sentiment Analysis",
        "description":"Sentiment analysis system with LSTM algorithm",
        "imageSrc":"https://raw.githubusercontent.com/Vincent-Zhul/personal-react-portfolio-DA/main/public/images/JDcomment.webp",
        "details":" Developed a sentiment analysis system with LSTM algorithms in TensorFlow to analyze JD Mall customer reviews, focusing on emotional content and satisfaction levels. - Utilized Scrapy for data collection, Pandas and NumPy for cleaning, and stored data in Hadoop HDFS, performing OLAP analytics with Apache Hive. - Processed Chinese text using jieba and Python scripts for tokenization, normalization, and Word2Vec feature engineering. - Trained the LSTM model on AWS EC2, using a Python based multiprocessing batch processing system for efficiency. - Visualized model performance with Matplotlib, providing clear insights into customer sentiments."},
    {   "id":"6",
        "title":"Stock Prediction with Sentiment Analysis",
        "description":"Sentiment analysis with NLTK and Spacy",
        "imageSrc":"https://raw.githubusercontent.com/Vincent-Zhul/personal-react-portfolio-DA/main/public/images/stockPrediction.webp",
        "details":" Utilized Python with Pandas and Numpy for data manipulation and preprocessing, creating dataframes to store tweet data and stock prices. - Employed NLTK and Spacy for sentiment analysis, and used Scikit Learn's RandomForestRegressor for stock price prediction based on sentiment scores. - Applied Matplotlib for data visualization to compare actual vs predicted stock prices, and explored CNN and RNN for potential accuracy improvements. - Achieved high accuracy, demonstrating the correlation between public sentiment and stock price movement."},
    {   "id":"7",
        "title":"Spotify Artists Analysis",
        "description":"Unveil the distinct musical styles and preferences",
        "imageSrc":"http://raw.githubusercontent.com/Vincent-Zhul/personal-react-portfolio-DA/main/public/images/Sportify.webp",
        "details":" Conducted data analysis to unveil the distinct musical styles and preferences across a diverse range of genres by analyzing the musical attributes of 50 mainstream artists on Spotify, leveraging the Spotify Web API to extract detailed audio features. - Used R packages like httr, jsonlite, and readr to handle API requests and data manipulation. - Applied K means Clustering in R to categorize artists into distinct groups, facilitating the understanding of genre specific characteristics and artist similarities. - Utilized D3.js for dynamic data visualization, creating interactive radar charts and PCA scatterplots to illustrate the relationships between various audio features and to display the artist clustering. - Documented the entire analytical process in an R Markdown file, integrating code, visual outputs, and narrative analysis to compile a comprehensive report."},
    {   "id":"8",
        "title":"Statistical Analysis in Phonetics",
        "description":"Data-driven phonetic study",
        "imageSrc":"http://raw.githubusercontent.com/Vincent-Zhul/personal-react-portfolio-DA/main/public/images/Phonetics.webp",
        "details":" Conducted a data driven phonetic study on the prosodic features of deferential speech in Mandarin among 26 participants, demonstrating the ability to predict deferential speech with over 95% accuracy using pitch span, and nearly 100% accuracy for other acoustic features. - Utilized R to perform Linear Mixed Effects Modeling, analyzing the relationship between speech features and variables such as gender and social attitudes. Refined the models systematically, focusing on statistically significant predictors and their effect sizes. - Used the ggplot2 package along with custom scripting to create insightful graphs and charts, illustrating the differential patterns in acoustic features across various speech conditions."}],
    "services":[],
    "aboutpara":"Hey there! I'm Lei Zhu, a passionate Data Analyst 📊 with a strong foundation in Computer Science and Information Science. My journey began at the University of Electronic Science and Technology of China (UESTC) 🎓, where I built a solid background in data structures, algorithms, and statistical analysis. Now, I'm pursuing my Master's degree at UIUC, diving deep into data mining, visualization, and business intelligence.\nThroughout my professional experiences, I've had the opportunity to apply my skills in various industries. As a Data Analyst Intern at Apple (Shanghai) , I conducted in-depth sales data analysis and implemented machine learning models 🤖 to optimize sales forecasts, leading to a 17% increase in revenue. I also designed A/B tests to refine promotional strategies, improving campaign performance by 17%. My role at DiDi Chuxing 🚗 focused on operational analytics, where I leveraged SQL and Tableau to develop real-time dashboards, reducing insurance costs by 25% and boosting driver retention to 92.7%📈. At SusallWave, I worked on ESG data analysis 🌍, utilizing NLP techniques to quantify unstructured data and create predictive models for corporate sustainability trends. My early experience at China Mingsheng Banking Corp 🏦 involved predictive modeling for credit risk assessment, achieving 95% accuracy ✅ in creditworthiness predictions.\nBeyond work, I’ve completed exciting projects like visualizing EU unemployment trends using Power BI and Tableau, analyzing Spotify artist data with clustering techniques 🎵, and conducting statistical phonetic research using R. My technical toolbox includes Python 🐍, R, SQL, Tableau, Power BI, and machine learning frameworks like Scikit-learn and Spark.\nWith a strong passion for turning data into actionable insights, I thrive on solving complex problems and making data-driven decisions. Let's connect and explore how data can drive innovation together! 🚀","resume":{"tagline":"👋 I'm a Data Analyst and Data Scientist","description":"Specializing in Python, R, and SQL, I have developed data-driven solutions, predictive models, and interactive dashboards that enhance decision-making and operational efficiency. With experience in machine learning, statistical analysis, A/B testing, and data visualization using tools like Tableau and Power BI, I excel at transforming complex datasets into actionable insights. My background in database management, cloud computing, and ETL processes enables me to build scalable data solutions. Passionate about leveraging data to drive business impact, I am always seeking new challenges and opportunities for growth in analytics and data science.",
    "experiences":[
        {   "id":"1",
            "dates":"June 2024 - August 2024",
            "type":"Internship",
            "position":"Data Analyst at Apple",
            "bullets":"Managed the Meituan online platform for all the MONO stores in China and conducted comprehensive sales data analysis, resulting in a YoY increase of 17% and 23% in sales and GMV. - Utilized SQL to query and manage datasets of over 2 million records, ensuring data integrity and accuracy. Developed robust data models using Python, including Random Forest models for feature selection and Multiple Linear Regression for predicting sales trends, which enhanced the granularity and accuracy of sales forecasts by 15%. Analyzed customer purchase data, seasonal trends, and marketing campaign effectiveness to provide actionable insights. - Designed and executed A/B test for 618 (Mid-year) Shopping Festival to evaluate promotional strategies, analyzing the resulting data to identify the most effective approaches, resulting in a 13% YoY improvement in campaign performance. - Developed and maintained weekly updated data dashboards using Tableau, providing dynamic and interactive visualizations that enhanced decision-making processes for senior management and cross-functional teams.",
            "url": "https://www.apple.com/"},
        {   "id":"2",
            "dates":"July 2022 - January 2023",
            "type":"Internship",
            "position":"Operational Data Analyst at DiDi Chuxing",
            "bullets":"Participated in a project to reduce costs and improve efficiency for drivers, providing data analysis to support strategies that increase driver retention rates. - Utilized SQL queries for comprehensive data retrieval and built dynamic dashboards with Tableau Server for real-time monitoring of driver behavior and insurance claims, with updates on a T+1 basis to support immediate operational decisions. - Designed two A/B tests to enhance driver personal insurance enrollment and reduce car insurance claims, using SQL for precise data segmentation and extraction. - Conducted statistical analysis using Python and R to evaluate the impact of operational strategies and A/B tests on reducing insurance costs and improving driver retention rates. Implemented strict data validation and analysis protocols to ensure data integrity and accuracy in reporting and decision-making. - Achieved a 25% reduction in insurance costs for drivers, a 37% decrease in claim rates, and increased driver retention rates from 85.2% to 92.7%.",
            "url": "https://www.didiglobal.com/"},
        {   "id":"3",
            "dates":"February 2022 - July 2022",
            "type":"Internship",
            "position":"ESG Data Analyst at Susallwave",
            "bullets":"Participated in an ESG data analysis project, quantifying unstructured data from the annual and responsibility reports of CSI 300 companies for data analysis and reporting. - Developed an ESG data analysis system, using Python and NLP technologies to systematically extract and quantify ESG performance indicators from textual data. - Created an ESG scoring framework to assess and rank companies based on their ESG practices, integrating the results into a dashboard for data visualization and analysis with Tableau. - Performed advanced statistical analysis to identify trends in corporate ESG behavior and correlations between different ESG indicators, providing data support for investors and stakeholders evaluating the company. - Enhanced the efficiency of ESG reporting by 20% and improved client satisfaction.",
            "url": "https://www.susallwave.com/"},
        {   "id":"4",
            "dates":"July 2021 - October 2021",
            "type":"Internship",
            "position":"Financial Data Analyst at Mingsheng Bank",
            "bullets":"Developed a data analysis system for the department, combining ETL processes and interactive dashboards to monitor user lifecycle and enhance loan processing efficiency. - Established automated ETL pipelines using Python, facilitating real-time data extraction, transformation, and loading, which enabled continuous monitoring and analysis of loan applicant behaviors and credit risk factors. - Constructed an interactive visualization dashboard utilizing Power BI, automating the monitoring of user lifecycle stages, from application to loan repayment, to identify patterns and trends that impact credit decisions. - Conducted in-depth statistical analysis and forecasting using R, employing tools like ggplot2, dplyr, tidyverse, and ARIMA models to provide predictive insights into loan demand and default rates, aiding in strategic planning and risk management. - Achieving a 95% accuracy rate in assessing creditworthiness and identifying risk factors.",
            "url": "https://www.cmbc.com.cn/"}],
    "education":[
        {   "universityName":"University of Illinois at Urbana-Champaign",
            "universityDate":"August 2023 - December 2024",
            "universityPara":"Master of Science in Information Science / Information Management",
            "universityURL": "https://www.illinois.edu/",
            "universityMajor": "https://ischool.illinois.edu/degrees-programs/graduate/ms-information-management"},
        {   "universityName":"University of Electronic Science and Technology of China",
            "universityDate":"August 2019 - June 2023",
            "universityPara":"Bachelor of Engineering in Computer Science & Technology",
            "universityURL": "https://en.uestc.edu.cn/",
            "universityMajor": "https://github.com/Vincent-Zhul/personal-react-portfolio-DA/blob/main/public/PDF/CSProgramIntro.pdf"}],
    "languages":["Java","Python","C/C++","Javascript","CSS","HTML5","C#","SQL","R","Swift","GraphQL"],
    "frameworks":["React","Typescript","NodeJs","Springboot","Angular","Redux","Material-UI",".NET"],
    "others":["AWS","GCP","NoSQL","ETL","Git","NLP","HDFS","Kafka","Jenkins","CI/CD","Docker"]}}